# Teach myself Dataframe

### import Necessary libraries

In [4]:
import numpy as np

In [5]:
x1 = np.random.randn(1,5)

In [6]:
x1

array([[-0.99390816, -0.54417413,  2.90811941,  2.62316915, -0.93075691]])

In [7]:
x2 = np.random.randint(1,5)

In [8]:
x2

3

In [9]:
x3 = np.random.randint(4,23,5)

In [10]:
x3

array([20,  8,  5,  5, 21])

In [11]:
df = pd.DataFrame(np.random.randint(0,25,size = (4,4)),['A','B','C','D'],['X','W','Y','Z'])

In [12]:
df

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [13]:
df['X'] #selecting column

A    11
B    23
C    15
D    14
Name: X, dtype: int64

In [14]:
df[['X','Y']] #selecting column

    X   Y
A  11  18
B  23   3
C  15  19
D  14  20

In [15]:
df['add'] = df['X'] + df['Y']

In [16]:
df

    X   W   Y   Z  add
A  11  19  18   7   29
B  23   1   3  18   26
C  15   8  19   5   34
D  14  13  20  24   34

In [17]:
df.drop('add',axis=1) #this not made any changes to dataframe due inplace argument was false

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [18]:
df #like this one

    X   W   Y   Z  add
A  11  19  18   7   29
B  23   1   3  18   26
C  15   8  19   5   34
D  14  13  20  24   34

In [19]:
df.drop('add',axis=1,inplace=True) #to apply 'drop' method changes to whole dataframe

In [20]:
df

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [21]:
df.drop('D',axis=0) #this remove D rows, set inplace argument by True to apply permanent changes to df

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5

In [22]:
df.shape

(4, 4)

In [23]:
df.loc['A'] #grab row

X    11
W    19
Y    18
Z     7
Name: A, dtype: int64

In [24]:
df.iloc[0] #grab row by index

X    11
W    19
Y    18
Z     7
Name: A, dtype: int64

In [25]:
df.loc['A','Y'] #grab value from specific table

18

In [26]:
df

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [27]:
df.loc[['A','C'],['X','Y']] #get subset of dataframe

    X   Y
A  11  18
C  15  19

In [28]:
df > 4 #get boolean of statement

      X      W      Y     Z
A  True   True   True  True
B  True  False  False  True
C  True   True   True  True
D  True   True   True  True

In [29]:
booldf = df[df > 4] #get rid of value of statement

In [30]:
booldf

    X     W     Y   Z
A  11  19.0  18.0   7
B  23   NaN   NaN  18
C  15   8.0  19.0   5
D  14  13.0  20.0  24

In [31]:
df

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [32]:
df['X']>5

A    True
B    True
C    True
D    True
Name: X, dtype: bool

In [33]:
df[df['X']>5]

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [34]:
df

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [35]:
df['Y'] == 0 #GRAB STATEMENT

A    False
B    False
C    False
D    False
Name: Y, dtype: bool

In [36]:
df[df['Y'] == 0] #RETURN ONLY ROW WITH TRUE STATEMENT

Empty DataFrame
Columns: [X, W, Y, Z]
Index: []

In [37]:
df

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [38]:
df[df['X']>9] #get row with value > 9 (A,B,C)

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [39]:
df[df['X']>9]['Y'] #get Y from previous processing

A    18
B     3
C    19
D    20
Name: Y, dtype: int64

In [40]:
df

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [41]:
boolser = df['Y']>0 #remove row where value > 0 ('B')
result = df[boolser] #get dataframe

In [42]:
result

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [43]:
result[['X','Z']] #get column

    X   Z
A  11   7
B  23  18
C  15   5
D  14  24

In [44]:
df

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [45]:
df[df['X'] > 9] #find and return row with column < 9

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [46]:
df[df['Y'] < 2] #find and return row with column equal 0

Empty DataFrame
Columns: [X, W, Y, Z]
Index: []

In [47]:
df[(df['X'] > 9) & (df['Y'] == 0)] #combination of the statement

Empty DataFrame
Columns: [X, W, Y, Z]
Index: []

In [48]:
df

    X   W   Y   Z
A  11  19  18   7
B  23   1   3  18
C  15   8  19   5
D  14  13  20  24

In [49]:
df.reset_index()

  index   X   W   Y   Z
0     A  11  19  18   7
1     B  23   1   3  18
2     C  15   8  19   5
3     D  14  13  20  24

In [50]:
new = 'EN ID CN US'.split()

In [51]:
new

['EN', 'ID', 'CN', 'US']

In [52]:
df['States'] = new #add new column to dataframe

In [53]:
df

    X   W   Y   Z States
A  11  19  18   7     EN
B  23   1   3  18     ID
C  15   8  19   5     CN
D  14  13  20  24     US

In [54]:
df.set_index('States') #replace ABCD with correspond selected value for new index

         X   W   Y   Z
States
EN      11  19  18   7
ID      23   1   3  18
CN      15   8  19   5
US      14  13  20  24

In [55]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [56]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [57]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [58]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [59]:
df

             A         B
G1 1 -1.671755 -0.122703
   2 -0.400278  0.149551
   3 -0.136663 -1.263813
G2 1 -0.537373  0.216607
   2 -0.825415  0.329885
   3  0.628918 -0.342811

In [60]:
df.loc['G1'] #get row of G1

          A         B
1 -1.671755 -0.122703
2 -0.400278  0.149551
3 -0.136663 -1.263813

In [61]:
df.loc['G2'].loc[1] #call multi index

A   -0.537373
B    0.216607
Name: 1, dtype: float64

In [62]:
df.index.names

FrozenList([None, None])

In [63]:
df

             A         B
G1 1 -1.671755 -0.122703
   2 -0.400278  0.149551
   3 -0.136663 -1.263813
G2 1 -0.537373  0.216607
   2 -0.825415  0.329885
   3  0.628918 -0.342811

In [64]:
df.index.names = ['Group','Number']

In [65]:
df

                     A         B
Group Number
G1    1      -1.671755 -0.122703
      2      -0.400278  0.149551
      3      -0.136663 -1.263813
G2    1      -0.537373  0.216607
      2      -0.825415  0.329885
      3       0.628918 -0.342811

In [66]:
df.loc['G2'].loc[2]['A'] #get specific value

-0.8254153091677362

In [67]:
df.xs(2,level='Number')

              A         B
Group
G1    -0.400278  0.149551
G2    -0.825415  0.329885

In [68]:
mydict = {'A':[1,2,np.nan],'B':[4,np.nan,np.nan],'C':[7,8,9]}

In [69]:
df = pd.DataFrame(mydict)

In [70]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [71]:
df.dropna() #remove row with 1 or more NaN

     A    B  C
0  1.0  4.0  7

In [72]:
df.dropna(axis=1) #remove col with 1 or more NaN

   C
0  7
1  8
2  9

In [73]:
df.dropna(thresh=2) #remove row with nan count => 2

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8

In [74]:
df.fillna('FILL')

      A     B  C
0     1     4  7
1     2  FILL  8
2  FILL  FILL  9

In [75]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [76]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [77]:
df = pd.DataFrame(data)

In [78]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [79]:
mycomp = df.groupby('Company')

In [80]:
mycomp.mean() #take mean of sales (pd automatically ignore person because it is string type data) and groupit.

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [81]:
mycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [82]:
mycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [83]:
mycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [84]:
df.groupby('Company').sum().loc['FB'] #simplify in one line

Sales    593
Name: FB, dtype: int64

In [85]:
df.groupby('Company').max() #get maximum of (string = most high order alphabet, int = highest value)

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [86]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [87]:
df.groupby('Company').describe() #all attribute sorted by companies

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [88]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [89]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [90]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [91]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [92]:
df4 = pd.concat([df1,df2,df3])

In [93]:
df4

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [94]:
df4.transpose()

   0   1   2   3   4   5   6   7   8   9    10   11
A  A0  A1  A2  A3  A4  A5  A6  A7  A8  A9  A10  A11
B  B0  B1  B2  B3  B4  B5  B6  B7  B8  B9  B10  B11
C  C0  C1  C2  C3  C4  C5  C6  C7  C8  C9  C10  C11
D  D0  D1  D2  D3  D4  D5  D6  D7  D8  D9  D10  D11

In [95]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [96]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [97]:
pd.merge(left, right)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [100]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [101]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [102]:
df['col2'].unique() #print any contain from column

array([444, 555, 666])

In [220]:
df['col2'].value_counts() #print how many times it repeated

444    2
555    1
666    1
Name: col2, dtype: int64

In [104]:
df['col2'].nunique() #len array of unique

3

In [106]:
df['col2'].value_counts() #print how many value repeated

444    2
555    1
666    1
Name: col2, dtype: int64

In [108]:
df['col1']>2 #print of correspond boolean of the row based on the statement

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [109]:
df[df['col1']>2] #returning dataframe which correspond of the 'True' statement of boolean

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [112]:
df[(df['col1']>2) & (df['col2']==444)] #only returning row which contain of col1 > 2 and col2 equals to 444

   col1  col2 col3
3     4   444  xyz

In [114]:
def sum10(x):   #define function
    return x+10

In [115]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [116]:
df['col1'].apply(sum10) #apply function to all column

0    11
1    12
2    13
3    14
Name: col1, dtype: int64

In [118]:
df['col2'].apply(lambda x:x+10) #apply using lambda function

0    454
1    565
2    676
3    454
Name: col2, dtype: int64

In [120]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [119]:
df.sort_values('col2') #sort column based on value of the selected column

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [121]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [122]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [126]:
df.sort_values('D') #sort current table

     A    B  C  D
0  foo  one  x  1
5  bar  one  y  1
2  foo  two  x  2
1  foo  one  y  3
4  bar  one  x  4
3  bar  two  y  5

In [131]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN